def main():
    print('хотите закодировать или раскодировать текст?')
    a = input()
    if a == 'закодировать':
        return encode_to_morse()
    elif a == 'раскодировать':
        return decode_from_morse()
    # функция запрашивает действие с текстом


# Плотникова

morze_russian = {
    'А': '.-',
    'Б': '-...',
    'В': '.--',
    'Г': '--.',
    'Д': '-..',
    'Е': '.',
    'Ж': '...-',
    'З': '--..',
    'И': '..',
    'Й': '.---',
    'К': '-.-',
    'Л': '.-..',
    'М': '--',
    'Н': '-.',
    'О': '---',
    'П': '.--.',
    'Р': '.-.',
    'С': '...',
    'Т': '-',
    'У': '..-',
    'Ф': '..-.',
    'Х': '....',
    'Ц': '-.-.',
    'Ч': '---.',
    'Ш': '----',
    'Щ': '--.-',
    'Ь': '--.--',
    'Ы': '-.--',
    'Ъ': '-..-',
    'Э': '..-..',
    'Ю': '..--',
    'Я': '.-.-',
}
morze_simbol = {
    '1': '.----',
    '2': '..---',
    '3': '...--',
    '4': '....-',
    '5': '.....',
    '6': '-....',
    '7': '--...',
    '8': '---..',
    '9': '----.',
    '0': '-----',
    '.': '......',
    ',': '.-.-.-',
    ':': '---...',
    ';': '-.-.-.',
    "'": ".----.",
    '"': '.-..-.',
    '-': '-....-',
    '/': '-..-.',
    '_': '..--.-',
    '?': '..--..',
    '!': '--..--',
    '+': '.-.-.',
    '@': '...-.-'
}
morze_english = {
    'A': '.-',
    'B': '-...',
    'W': '.--',
    'G': '--.',
    'D': '-..',
    'E': '.',
    'V': '...-',
    'Z': '--..',
    'I': '..',
    'J': '.---',
    'K': '-.-',
    'L': '.-..',
    'M': '--',
    'N': '-.',
    'O': '---',
    'P': '.--.',
    'R': '.-.',
    'S': '...',
    'T': '-',
    'U': '..-',
    'F': '..-.',
    'H': '....',
    'C': '-.-.',
    'Q': '--.-',
    'Y': '-.--',
    'X': '-..-'
}


# Шиндин

def encode_to_morse():
    print('выберите какой язык вы хотите закодировать: Английский или Русский')
    language = input()
    if language == 'Русский':
        print('введите текст, который вы хотите закодировать')
        phrase = input().upper()
        for i in phrase:
            if i in morze_russian:
                print(morze_russian[i])
            elif i in morze_simbol:
                print(morze_simbol[i])
            else:
                print()

    elif language == 'Английский':
        print('Введите текст, который вы хотите закодировать')
        phrase = input().upper()
        for i in phrase:
            if i in morze_english:
                print(morze_english[i])
            elif i in morze_simbol:
                print(morze_simbol[i])
            else:
                print()
    # кодирование ввода в азбуку морзе


# Плотникова

decode_morze_russian = {
    '.-': 'А',
    '-...': 'Б',
    '.--': 'В',
    '--.': 'Г',
    '-..': 'Д',
    '.': 'Е',
    '...-': 'Ж',
    '--..': 'З',
    '..': 'И',
    '.---': 'Й',
    '-.-': 'К',
    '.-..': 'Л',
    '--': 'М',
    '-.': 'Н',
    '---': 'О',
    '.--.': 'П',
    '.-.': 'Р',
    '...': 'С',
    '-': 'Т',
    '..-': 'У',
    '..-.': 'Ф',
    '....': 'Х',
    '-.-.': 'Ц',
    '---.': 'Ч',
    '----': 'Ш',
    '--.-': 'Щ',
    '--.--': 'Ь',
    '-.--': 'Ы',
    '-..-': 'Ъ',
    '..-..': 'Э',
    '..--': 'Ю',
    '.-.-': 'Я'}
simbols = {
    '.----': '1',
    '..---': '2',
    '...--': '3',
    '....-': '4',
    '.....': '5',
    '-....': '6',
    '--...': '7',
    '---..': '8',
    '----.': '9',
    '-----': '0',
    '......': '.',
    '.-.-.-': ',',
    '---...': ':',
    '-.-.-.': ';',
    '.----.': "'",
    '.-..-.': '"',
    '-....-': '-',
    '-..-.': '/',
    '..--.-': '_',
    '..--..': '?',
    '--..--': '!',
    '.-.-.': '+',
    '...-.-': '@'
}
decode_morze_english = {
    '.-': 'A',
    '-...': 'B',
    '.--': 'W',
    '--.': 'G',
    '-..': 'D',
    '.': 'E',
    '...-': 'V',
    '--..': 'Z',
    '..': 'I',
    '.---': 'J',
    '-.-': 'K',
    '.-..': 'L',
    '--': 'M',
    '-.': 'N',
    '---': 'O',
    '.--.': 'P',
    '.-.': 'R',
    '...': 'S',
    '-': 'T',
    '..-': 'U',
    '..-.': 'F',
    '....': 'H',
    '-.-.': 'C',
    '--.-': 'Q',
    '-.--': 'Y',
    '-..-': 'X'
}


# словарь наоборот для декодирования


def decode_from_morse():
    print('Введите какой язык вы хотите декодировать: Английский или Русский?')
    language = input()
    if language == 'Русский':
        print('Введите текст (кодом азбуки Морзе через пробел), который вы хотите декодировать.')
        phrase = input().split()
        for i in phrase:
            if i in decode_morze_russian:
                print(decode_morze_russian[i], end='\t')
            elif i in simbols:
                print(simbols[i], end='\t')
            elif i == ' ':
                print()
    elif language == 'Английский':
        print('Введите текст (кодом азбуки Морзе через пробел), который вы хотите декодировать.')
        phrase = input().split()
        for i in phrase:
            if i in decode_morze_english:
                print(decode_morze_english[i], end='\t')
            elif i in simbols:
                print(simbols[i], end='\t')
            elif i == ' ':
                print()
    else:
        print('Извините, выбранного языка нет в программе.')
    # функция декодирования из азбуки морза


# Гуфраев

main()
