decode_morze_russian = {
    '.-': 'А',
    '-...': 'Б',
    '.--': 'В',
    '--.': 'Г',
    '-..': 'Д',
    '.': 'Е',
    '...-': 'Ж',
    '--..': 'З',
    '..': 'И',
    '.---': 'Й',
    '-.-': 'К',
    '.-..': 'Л',
    '--': 'М',
    '-.': 'Н',
    '---': 'О',
    '.--.': 'П',
    '.-.': 'Р',
    '...': 'С',
    '-': 'Т',
    '..-': 'У',
    '..-.': 'Ф',
    '....': 'Х',
    '-.-.': 'Ц',
    '---.': 'Ч',
    '----': 'Ш',
    '--.-': 'Щ',
    '--.--': 'Ь',
    '-.--': 'Ы',
    '-..-': 'Ъ',
    '..-..': 'Э',
    '..--': 'Ю',
    '.-.-': 'Я'}
simbols = {
    '.----': '1',
    '..---': '2',
    '...--': '3',
    '....-': '4',
    '.....': '5',
    '-....': '6',
    '--...': '7',
    '---..': '8',
    '----.': '9',
    '-----': '0',
    '......': '.',
    '.-.-.-': ',',
    '---...': ':',
    '-.-.-.': ';',
    '.----.': "'",
    '.-..-.': '"',
    '-....-': '-',
    '-..-.': '/',
    '..--.-': '_',
    '..--..': '?',
    '--..--': '!',
    '.-.-.': '+',
    '...-.-': '@'
}
decode_morze_english = {
    '.-': 'A',
    '-...': 'B',
    '.--': 'W',
    '--.': 'G',
    '-..': 'D',
    '.': 'E',
    '...-': 'V',
    '--..': 'Z',
    '..': 'I',
    '.---': 'J',
    '-.-': 'K',
    '.-..': 'L',
    '--': 'M',
    '-.': 'N',
    '---': 'O',
    '.--.': 'P',
    '.-.': 'R',
    '...': 'S',
    '-': 'T',
    '..-': 'U',
    '..-.': 'F',
    '....': 'H',
    '-.-.': 'C',
    '--.-': 'Q',
    '-.--': 'Y',
    '-..-': 'X'
}


def decode_from_morse():
    print('Введите какой язык вы хотите декодировать: "Английский","Русский"')
    language = input()
    if language == 'Русский':
        phrase = input().split()
        for i in phrase:
            if i in decode_morze_russian:
                print(decode_morze_russian[i], end='\t')
            elif i in simbols:
                print(simbols[i], end='\t')
            elif i == ' ':
                print()
    elif language == 'Английский':
        phrase = input().split()
        for i in phrase:
            if i in decode_morze_english:
                print(decode_morze_english[i], end='\t')
            elif i in simbols:
                print(simbols[i], end='\t')
            elif i == ' ':
                print()
    else:
        print('Извините, выбранного языка нет в программе.')


decode_from_morse()
